# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3

def test(num):
    for i in range(2, n):
        if n % i == 0:
           return False if n % i == 0
    return True
n = int(input("Введите число: "))
print(test(n))    
