# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# [1, 1, 2, 3, 4, 4] -> 4

# a = set(input())
# b = -1
# for i in a:
#     b += 1
# print(b)    

print(len(set(input().split())))